Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
/*
 * GRBL-like G-code system command and real-time handling for UGS compatibility.
 * Real-time chars: ?, ~, !, 0x18 (Ctrl+X soft reset)
 * System commands: $$, $#, $G, $I, $N / $Nn=, $C, $X, $RST=*, $RST=$, $RST=#, $F, single $
 * Generic settings read/write: $<number>, $<number>=<value>
 * G-code queue + event translation (subset)
 *
 * Soft reset handling (Ctrl+X and literal "0x18") uses UART_SoftReset() (uart_utils.c).
 */

#include <stddef.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <stdio.h>
#include <ctype.h>
#include <math.h>

#include "gcode_parser.h"
#include "common.h"
#include "app.h"          // For APP_Initialize()
#include "stepper.h"
#include "motion.h"
#include "motion_utils.h" // For MOTION_UTILS_EnableAllAxes()
#include "kinematics.h"
#include "motion/homing.h"
#include "utils.h"
#include "settings.h"
#include "data_structures.h"
#include "utils/uart_utils.h"
#ifdef HAS_TMC5160_AXIS
#include "motion/tmc5160.h"   // For TMC5160_ApplySettings()
#endif
#include "../config/default/peripheral/uart/plib_uart3.h"
#include <xc.h>  // For RSWRST, SYSKEY, and processor registers
#include "definitions.h"                  // For T4CON/_T4CON_ON_MASK (hardware state)
#include "../config/default/peripheral/gpio/plib_gpio.h"  // For LED debug

/* -------------------------------------------------------------------------- */
/* Configuration                                                              */
/* -------------------------------------------------------------------------- */
#define ENABLE_STARTUP_BANNER     // Enable/disable startup banner
                                  // G-code senders (UGS, bCNC) expect this banner
                                  // Comment out to disable for debugging or custom ID

// Banner message configured in common.h via STARTUP_BANNER_STRING macro

// Dual-threshold flow control for UGS compatibility
// HIGH_WATER: Start deferring "ok" when queue reaches this (almost full)
// LOW_WATER: Resume sending "ok" when queue drains to this (some space freed)
// With MAX=16: Defer at 15 (1 free), Resume at 12 (4 drained)
#define MOTION_BUFFER_HIGH_WATER 1    // Defer when (MAX - 1) = 15 segments used
#define MOTION_BUFFER_LOW_WATER  4    // Resume when (MAX - 4) = 12 segments used

/* -------------------------------------------------------------------------- */
/* Static Buffers / State                                                     */
/* -------------------------------------------------------------------------- */
static uint8_t txBuffer[1024];
static uint8_t rxBuffer[512];  // Increased to match UART3 RX buffer size
static volatile uint32_t nBytesRead = 0;

GCODE_Data gcodeData = {
    .state = GCODE_STATE_IDLE,
};

static uint32_t okPendingCount = 0;         // Flow control: count of deferred "ok" responses
static bool grblCheckMode = false;          /* $C toggle */
static bool grblAlarm = false;              /* $X clears alarm */
static bool feedHoldActive = false;         /* '!' feed hold, '~' resume */
static char startupLines[2][GCODE_BUFFER_SIZE] = {{0},{0}}; /* $N0 / $N1 */
static bool unitsInches = false;            /* false=mm (G21), true=inches (G20) */

/* ✅ REMOVED: Startup deferral variables (caused UGS stalling) */

/* -------------------------------------------------------------------------- */
/* Forward Declarations                                                       */
/* -------------------------------------------------------------------------- */
// Control characters that should be handled specially (not treated as G-code)
// 0x18 = Ctrl+X (soft reset)
// 0x95 = XOFF (flow control - ignored)
// 0x90 = DLE (data link escape - ignored)  
// 0x11 = XON (flow control - ignored)
// 0x13 = DC3/XOFF (flow control - ignored)
static inline bool is_control_char(uint8_t c){ 
    return (c == '?' || c == '~' || c == '!' || c == 0x18 || 
            c == 0x95 || c == 0x90 || c == 0x99 || c == 0x11 || c == 0x13); 
}
GCODE_CommandQueue* Extract_CommandLineFrom_Buffer(uint8_t* buffer, uint32_t length, GCODE_CommandQueue* commandQueue);


static inline char* find_char(char* s, char key){
    while (*s){
        if (*s == key) return s;
        s++;
    }
    return NULL;
}
static float parse_float_after(char* start){
    if (!start || !start[1]) return NAN;
    char* endptr = NULL;
    float value = (float)strtof(start + 1, &endptr);
    // If no conversion occurred, endptr == start+1
    if (endptr == start + 1) return NAN;
    return value;
}

/* -------------------------------------------------------------------------- */
/* Centralized Soft Reset (PUBLIC FUNCTION)                                  */
/* -------------------------------------------------------------------------- */
void GCODE_SoftReset(APP_DATA* appData, GCODE_CommandQueue* cmdQueue)
{
    if (appData == NULL || cmdQueue == NULL) {
        return;
    }

    DEBUG_PRINT_GCODE("[SOFT RESET] Software reset - clearing buffers and state\r\n");
    
    /* 1. Stop all motion immediately */
    STEPPER_StopMotion();  // Disables steppers, stops TMR4, disables OC1
    HOMING_Abort();        // Abort homing if in progress
    
    /* 2. Re-initialize stepper module (clears Bresenham state, direction bits, etc.) */
    // This fixes the X-axis selective disable issue after soft reset
    STEPPER_Initialize(appData);
    
    /* 3. Flush UART RX buffer to avoid processing pre-reset commands */
    uint8_t scratch[64];
    uint32_t rc;
    while ((rc = UART3_ReadCountGet()) > 0U) {
        uint32_t toRead = (rc > sizeof(scratch)) ? (uint32_t)sizeof(scratch) : rc;
        (void)UART3_Read(scratch, toRead);
    }
    

        /* 10. Clear RX buffer */
    nBytesRead = 0;
    memset(rxBuffer, 0, sizeof(rxBuffer));

    /* 3. Clear motion queue */
    memset(appData->motionQueue, 0, sizeof(appData->motionQueue));
    appData->motionQueueHead = 0;
    appData->motionQueueTail = 0;
    appData->motionQueueCount = 0;
    appData->currentSegment = NULL;
    appData->motionSegmentCompleted = false;
    
