Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
/* -------------------------------------------------------------------------- */
/* Command -> Event Parser                                                    */
/* -------------------------------------------------------------------------- */
static bool parse_command_to_event(const char* cmd, GCODE_Event* ev)
{
    if (!cmd || !ev) return false;
    ev->type = GCODE_EVENT_NONE;

    // Axis letter array for scalable parsing (shared across all parsing blocks)
    static const char axis_letters[NUM_AXIS] = {'X', 'Y', 'Z', 'A'};

    DEBUG_PRINT_GCODE("[PARSE] cmd='%s'\r\n", cmd);

    if (cmd[0] == 'G') {
        char* pend = NULL;
        int gnum = (int)strtol(&cmd[1], &pend, 10);
        
        DEBUG_PRINT_GCODE("[PARSE] G-code detected: gnum=%d\r\n", gnum);

        // G20/G21 - Units (handled internally, no event needed)
        if (gnum == 20) { unitsInches = true; ev->type = GCODE_EVENT_NONE; return true; }
        if (gnum == 21) { unitsInches = false; ev->type = GCODE_EVENT_NONE; return true; }
        
        // G90/G91 - Positioning mode
        if (gnum == 90) { ev->type = GCODE_EVENT_SET_ABSOLUTE; return true; }
        if (gnum == 91) { ev->type = GCODE_EVENT_SET_RELATIVE; return true; }

        // Work coordinate system selection (G54-G59)
        if (gnum >= 54 && gnum <= 59) {
            ev->type = GCODE_EVENT_SET_WCS;
            ev->data.setWCS.wcs_number = gnum - 54;  // G54=0, G55=1, ..., G59=5
            return true;
        }

        // G92 - Set work coordinate offset (same as G10 L20 P0)
        if (gnum == 92) {
            StepperPosition* pos = STEPPER_GetPosition();
            WorkCoordinateSystem* wcs = KINEMATICS_GetWorkCoordinates();
            const float unit_scale = unitsInches ? 25.4f : 1.0f;
            
            // Array-based axis parameter parsing with loop
            float desired[NUM_AXIS];
            float mpos[NUM_AXIS];
            
            // Parse all axis parameters using loop
            for (E_AXIS axis = AXIS_X; axis < NUM_AXIS; axis++) {
                char* pAxis = find_char((char*)cmd, axis_letters[axis]);
                desired[axis] = pAxis ? (parse_float_after(pAxis) * unit_scale) : NAN;
                mpos[axis] = (float)pos->steps[axis] / pos->steps_per_mm[axis];
            }
            
            // Set offset = MachinePos - DesiredWorkPos (only X, Y, Z supported in WCS)
            for (E_AXIS axis = AXIS_X; axis < AXIS_Z + 1; axis++) {
                if (!isnan(desired[axis])) {
                    SET_COORDINATE_AXIS(&wcs->offset, axis, mpos[axis] - desired[axis]);
                }
            }
            
            return true;
        }

        if (gnum == 10) {
            char* pP = find_char((char*)cmd, 'P');
            char* pL = find_char((char*)cmd, 'L');
            int p_val = pP ? (int)strtol(pP + 1, NULL, 10) : 0;
            int l_val = pL ? (int)strtol(pL + 1, NULL, 10) : 0;
            if (l_val == 20) {
                if (p_val == 0 || p_val == 1) {
                    StepperPosition* pos = STEPPER_GetPosition();
                    WorkCoordinateSystem* wcs = KINEMATICS_GetWorkCoordinates();
                    const float unit_scale = unitsInches ? 25.4f : 1.0f;
                    
                    // Array-based axis parameter parsing with loop
                    float desired[NUM_AXIS];
                    float mpos[NUM_AXIS];
                    
                    for (E_AXIS axis = AXIS_X; axis < NUM_AXIS; axis++) {
                        char* pAxis = find_char((char*)cmd, axis_letters[axis]);
                        desired[axis] = pAxis ? (parse_float_after(pAxis) * unit_scale) : NAN;
                        mpos[axis] = (float)pos->steps[axis] / pos->steps_per_mm[axis];
                    }
                    
                    // Set WCS offset (only X, Y, Z supported)
                    for (E_AXIS axis = AXIS_X; axis < AXIS_Z + 1; axis++) {
                        if (!isnan(desired[axis])) {
                            SET_COORDINATE_AXIS(&wcs->offset, axis, mpos[axis] - desired[axis]);
                        }
                    }
                    
                    return true;
                } else {
                    return true;
                }
            } else {
                return true;
            }
        }

        // G38.2, G38.3, G38.4, G38.5 - Probe commands
        if (gnum == 38) {
            // Parse subcode after decimal point (e.g., G38.2 -> subcode = 2)
            char* pDot = find_char((char*)cmd, '.');
            if (pDot) {
                int subcode = (int)strtol(pDot + 1, NULL, 10);
                if (subcode >= 2 && subcode <= 5) {
                    // Determine probe direction and alarm behavior
                    if (subcode == 2 || subcode == 3) {
                        ev->type = GCODE_EVENT_PROBE_TOWARD;  // Probe toward workpiece
                        ev->data.probe.probe_toward = true;
                    } else {  // subcode == 4 || subcode == 5
                        ev->type = GCODE_EVENT_PROBE_AWAY;    // Probe away from workpiece
                        ev->data.probe.probe_toward = false;
                    }
                    
                    // Set alarm behavior: G38.2 and G38.4 alarm on failure
                    ev->data.probe.alarm_on_fail = (subcode == 2 || subcode == 4);
                    
                    // Parse axis parameters and feedrate
                    const float unit_scale = unitsInches ? 25.4f : 1.0f;
                    
                    // Array-based axis parameter parsing
                    float axis_values[NUM_AXIS];
                    for (E_AXIS axis = AXIS_X; axis < NUM_AXIS; axis++) {
                        char* pAxis = find_char((char*)cmd, axis_letters[axis]);
                        axis_values[axis] = pAxis ? parse_float_after(pAxis) : NAN;
                    }
                    
                    // Store target coordinates (NAN = no change for that axis)
                    ev->data.probe.x = !isnan(axis_values[AXIS_X]) ? axis_values[AXIS_X] * unit_scale : NAN;
                    ev->data.probe.y = !isnan(axis_values[AXIS_Y]) ? axis_values[AXIS_Y] * unit_scale : NAN;
                    ev->data.probe.z = !isnan(axis_values[AXIS_Z]) ? axis_values[AXIS_Z] * unit_scale : NAN;
                    ev->data.probe.a = !isnan(axis_values[AXIS_A]) ? axis_values[AXIS_A] * unit_scale : NAN;
                    
                    // Parse feedrate (required for probe moves)
                    char* pF = find_char((char*)cmd, 'F');
                    ev->data.probe.feedrate = pF ? (parse_float_after(pF) * unit_scale) : 0.0f;
                    
