Davec6505/Pic32mzCNC_V3/srcs/gcode/gcode_parser.c
/* -------------------------------------------------------------------------- */
/* Flow Control Helpers - Centralized OK Management                           */
/* -------------------------------------------------------------------------- */

/* Removed IsOkPending/SetOkPending/ClearOkPending helpers to avoid unused warnings;
   logic now accesses okPending directly inside the flow-control helpers below. */

/**
 * @brief Compute high-water mark for flow control (when to START deferring ok)
 * 
 * Returns maxSegments - HIGH_WATER threshold
 * Example: With MAX=16, HIGH_WATER=2 → defer when queue >= 14
 */
static inline uint32_t Flow_HighWater(const GCODE_CommandQueue* q)
{
    if (q == NULL) return 0U;
    return (q->maxMotionSegments > MOTION_BUFFER_HIGH_WATER)
         ? (uint32_t)(q->maxMotionSegments - MOTION_BUFFER_HIGH_WATER)
         : 0U;
}

/**
 * @brief Compute low-water mark for flow control (when to RESUME sending ok)
 * 
 * Returns maxSegments - LOW_WATER threshold
 * Example: With MAX=16, LOW_WATER=4 → resume when queue <= 12
 */
static inline uint32_t Flow_LowWater(const GCODE_CommandQueue* q)
{
    if (q == NULL) return 0U;
    return (q->maxMotionSegments > MOTION_BUFFER_LOW_WATER)
         ? (uint32_t)(q->maxMotionSegments - MOTION_BUFFER_LOW_WATER)
         : 0U;
}

/**
 * @brief Check if we should send a deferred "ok" response
 * 
 * With aggressive flow control, only send deferred "ok" when motion queue
 * is COMPLETELY empty. This ensures UGS doesn't see "Finished" until all
 * motion has executed.
 * 
 * @param appData Application data with motion queue count
 * @param q Command queue (unused with current logic)
 */
void GCODE_CheckDeferredOk(APP_DATA* appData, GCODE_CommandQueue* q) {
    // Send deferred "ok" responses when buffer drops below low-water mark
    // This prevents deadlock on long motion files while still providing backpressure
    uint32_t lowWater = appData->gcodeCommandQueue.maxMotionSegments - MOTION_BUFFER_LOW_WATER;
    
    while (okPendingCount > 0 && appData->motionQueueCount < lowWater) {
        DEBUG_PRINT_GCODE("[DEFERRED] Sending deferred ok (queue=%lu < lowWater=%lu, pending=%lu)\r\n",
                          (unsigned long)appData->motionQueueCount, (unsigned long)lowWater,
                          (unsigned long)okPendingCount);
        if (UART_SendOK()) {
            okPendingCount--;
        } else {
            break;  // TX buffer full, try again next iteration
        }
    }
}

/**
 * @brief Decide whether to send "ok" immediately or defer it
 * 
 * Called when a command is received.
 * Uses HIGH_WATER threshold - defers ok when buffer is almost full.
 * 
 * @param currentQueueCount Current motion queue count
 * @param maxSegments Maximum motion queue size
 */
static void SendOrDeferOk(APP_DATA* appData, GCODE_CommandQueue* q)
{
    // ✅ Dual-threshold flow control to keep motion buffer fed
    // Defer "ok" when buffer reaches high-water mark (almost full)
    // Resume sending "ok" when buffer drains to low-water mark
    
    uint32_t highWater = Flow_HighWater(q);  // maxSegments - 2 (defer when 14/16 used)
    
    if (appData->motionQueueCount >= highWater) {
        // Buffer almost full - defer this "ok" to apply backpressure
        DEBUG_PRINT_GCODE("[FLOW] Deferring ok (queue=%lu >= highWater=%lu, pending=%lu)\r\n", 
                          (unsigned long)appData->motionQueueCount,
                          (unsigned long)highWater,
                          (unsigned long)(okPendingCount + 1));
        okPendingCount++;
    } else {
        // Buffer has space - send "ok" immediately
        DEBUG_PRINT_GCODE("[FLOW] Sending immediate ok (queue=%lu < highWater=%lu)\r\n",
                          (unsigned long)appData->motionQueueCount,
                          (unsigned long)highWater);
        (void)UART_SendOK();
    }
}

/* -------------------------------------------------------------------------- */
/* Main G-code / Protocol Tasks                                               */
/* -------------------------------------------------------------------------- */
void GCODE_Tasks(APP_DATA* appData, GCODE_CommandQueue* commandQueue)
{
    static uint32_t call_counter = 0;
    call_counter++;
    
    // if ((call_counter % 10000) == 0) {
    //     DEBUG_PRINT_GCODE("[GCODE_Tasks] Called %lu times, state=%d\r\n", 
    //                      call_counter, gcodeData.state);
    // }
    
    GCODE_CommandQueue* cmdQueue = commandQueue;
    uint32_t nBytesAvailable = 0;

    // ✅ CRITICAL: Check deferred "ok" ONCE at entry using FRESH count
    // If buffer drained and okPending, send "ok" immediately then continue processing
    GCODE_CheckDeferredOk(appData, cmdQueue);

    switch (gcodeData.state)
    {
    case GCODE_STATE_IDLE:
        nBytesAvailable = UART3_ReadCountGet();
        if (nBytesAvailable > 0) {
            uint32_t space = (uint32_t)(sizeof(rxBuffer) - 1U - nBytesRead);
            if (space > 0U) {
                uint32_t toRead = (nBytesAvailable < space) ? nBytesAvailable : space;
                uint32_t got = UART3_Read(&rxBuffer[nBytesRead], toRead);
                nBytesRead += got;
                rxBuffer[nBytesRead] = '\0';
            }
        } else {
            // ✅ No new bytes arriving - check for deferred ok
            // This runs every iteration when idle, ensuring final "ok" is sent
            GCODE_CheckDeferredOk(appData, cmdQueue);
        }

        if (nBytesRead == 0) {
            break;  // No data in buffer, exit IDLE state
        }

        /* Literal "0x18" typed by user */
        if (nBytesRead >= 4 &&
            rxBuffer[0] == '0' && rxBuffer[1] == 'x' &&
            rxBuffer[2] == '1' && rxBuffer[3] == '8') {
            GCODE_SoftReset(appData, cmdQueue);
            break;
        }

        if (is_control_char(rxBuffer[0])) {
            gcodeData.state = GCODE_STATE_CONTROL_CHAR;
        } else {
            bool has_terminator = false;
            uint32_t terminator_pos = 0;
            for (uint32_t i = 0; i < nBytesRead; i++) {
                if (rxBuffer[i] == '\n' || rxBuffer[i] == '\r') {
                    has_terminator = true;
                    terminator_pos = i;
                    break;
                }
            }
            if (!has_terminator) break;
            rxBuffer[terminator_pos] = '\0';

